WSC-Gen_REST_composite/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://j2ee.netbeans.org/wsdl/WSC-Gen_BPEL_REST/src/Generator_Client_REST">
  <soapenv:Body>
    <gen:Generator_Client_RESTOperation>
      <part1>bpel</part1>
    </gen:Generator_Client_RESTOperation>
  </soapenv:Body>
</soapenv:Envelope>